import * as PIXI from 'pixi.js';

//цвет границы
export const BORDER_COLOR = 0xfeeb77;
//цвет заполнения клетки
export const CUBE_FILL_COLOR = 0xffffff;
//граница клетки
export const WIDTH_BORDER = 4;
//сколько будет по ширине клеток
export const WIDTH_FIELD = 10;
//количество клеток по высоте
export const HEIGHT_FIELD = 20;
//на сколько градусов поворачивать фигуру
export const ROTATE_SHAPE = 90;

/*список фигур с их координатами для всех поворотов:
- каждая фигура представлена четырьмя массивами, по одному для каждого поворота (0, 90, 180, 270 градусов).
- координаты указывают на относительное положение блоков фигуры от стартового квадратика (0,0).
- эти координаты используются для рисования фигуры в сетке игры
- также указываем цвет фигуры
*/
export const WORD_SHAPE = {
    "O": {
        color: "yellow",
        rotations: {
            "0":   [[0,0], [-1,0], [-1,-1], [0,-1]], // Поворот 0
            "90":  [[0,0], [-1,0], [-1,-1], [0,-1]], // Поворот 90
            "180": [[0,0], [-1,0], [-1,-1], [0,-1]], // Поворот 180
            "270": [[0,0], [-1,0], [-1,-1], [0,-1]]  // Поворот 270
        }
    },
    "I": {
        color: "cyan",
        rotations: {
            "0":   [[0,0], [1,0], [-1,0], [-2,0]],  // Поворот 0
            "90":  [[0,0], [0,1], [0,-1], [0,-2]],  // Поворот 90
            "180": [[0,0], [1,0], [-1,0], [-2,0]],  // Поворот 180
            "270": [[0,0], [0,1], [0,-1], [0,-2]]   // Поворот 270
        }
    },
    "S": {
        color: "green",
        rotations: {
            "0":   [[0,0], [1,0], [0,1], [-1,1]],   // Поворот 0
            "90":  [[0,0], [0,1], [-1,0], [-1,-1]], // Поворот 90
            "180": [[0,0], [1,0], [0,1], [-1,1]],   // Поворот 180
            "270": [[0,0], [0,1], [-1,0], [-1,-1]]  // Поворот 270
        }
    },
    "Z": {
        color: "red",
        rotations: {
            "0":   [[0,0], [1,0], [0,-1], [-1,-1]], // Поворот 0
            "90":  [[0,0], [0,1], [1,0], [1,-1]],   // Поворот 90
            "180": [[0,0], [1,0], [0,-1], [-1,-1]], // Поворот 180
            "270": [[0,0], [0,1], [1,0], [1,-1]]    // Поворот 270
        }
    },
    "L": {
        color: "orange",
        rotations: {
            "0":   [[0,0], [1,0], [-1,0], [-1,1]],  // Поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,-1]], // Поворот 90
            "180": [[0,0], [1,0], [-1,0], [1,-1]],  // Поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,1]]    // Поворот 270
        }
    },
    "J": {
        color: "blue",
        rotations: {
            "0":   [[0,0], [-1,0], [1,0], [1,1]],   // Поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,1]],  // Поворот 90
            "180": [[0,0], [-1,0], [1,0], [-1,-1]], // Поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,-1]]   // Поворот 270
        }
    },
    "T": {
        color: "purple",
        rotations: {
            "0":   [[0,0], [-1,0], [1,0], [0,1]],   // Поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,0]],  // Поворот 90
            "180": [[0,0], [-1,0], [1,0], [0,-1]],  // Поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,0]]    // Поворот 270
        }
    }
};

