import * as PIXI from 'pixi.js';

//цвет границы
export const BORDER_COLOR = 0xfeeb77;
//цвет заполнения клетки
export const CUBE_FILL_COLOR = 0xffffff;
//ширина границы клетки
export const WIDTH_BORDER = 4;
//ширина игрового поля (в клетках)
export const WIDTH_FIELD = 10;
//высота игрового поля (в клетках)
export const HEIGHT_FIELD = 20;
//угол поворота фигуры
export const ROTATE_SHAPE = 90;
//скорость падения фигуры в миллисекундах
export const FALLING_SPEED = 700;
//константа для центральной колонки игрового поля
export const CENTER_COLUMN = Math.floor(WIDTH_FIELD / 2);

/* 
список фигур с их цветами и координатами для всех поворотов:
- каждая фигура представлена четырьмя массивами, по одному для каждого поворота (0, 90, 180, 270 градусов).
- координаты указывают на относительное положение блоков фигуры от стартового квадратика (0,0).
- эти координаты используются для рисования фигуры в сетке игры.
- также указываем цвет фигуры.
*/
export const WORD_SHAPE = {
    "O": {
        color: "yellow",
        rotations: {
            "0":   [[0,0], [-1,0], [-1,-1], [0,-1]], //поворот 0
            "90":  [[0,0], [-1,0], [-1,-1], [0,-1]], //поворот 90
            "180": [[0,0], [-1,0], [-1,-1], [0,-1]], //поворот 180
            "270": [[0,0], [-1,0], [-1,-1], [0,-1]]  //поворот 270
        }
    },
    "I": {
        color: "cyan",
        rotations: {
            "0":   [[0,0], [1,0], [-1,0], [-2,0]],  //поворот 0
            "90":  [[0,0], [0,1], [0,-1], [0,-2]],  //поворот 90
            "180": [[0,0], [1,0], [-1,0], [-2,0]],  //поворот 180
            "270": [[0,0], [0,1], [0,-1], [0,-2]]   //поворот 270
        }
    },
    "S": {
        color: "green",
        rotations: {
            "0":   [[0,0], [1,0], [0,1], [-1,1]],   //поворот 0
            "90":  [[0,0], [0,1], [-1,0], [-1,-1]], //поворот 90
            "180": [[0,0], [1,0], [0,1], [-1,1]],   //поворот 180
            "270": [[0,0], [0,1], [-1,0], [-1,-1]]  //поворот 270
        }
    },
    "Z": {
        color: "red",
        rotations: {
            "0":   [[0,0], [1,0], [0,-1], [-1,-1]], //поворот 0
            "90":  [[0,0], [0,1], [1,0], [1,-1]],   //поворот 90
            "180": [[0,0], [1,0], [0,-1], [-1,-1]], //поворот 180
            "270": [[0,0], [0,1], [1,0], [1,-1]]    //поворот 270
        }
    },
    "L": {
        color: "orange",
        rotations: {
            "0":   [[0,0], [1,0], [-1,0], [-1,1]],  //поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,-1]], //поворот 90
            "180": [[0,0], [1,0], [-1,0], [1,-1]],  //поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,1]]    //поворот 270
        }
    },
    "J": {
        color: "blue",
        rotations: {
            "0":   [[0,0], [-1,0], [1,0], [1,1]],   //поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,1]],  //поворот 90
            "180": [[0,0], [-1,0], [1,0], [-1,-1]], //поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,-1]]   //поворот 270
        }
    },
    "T": {
        color: "purple",
        rotations: {
            "0":   [[0,0], [-1,0], [1,0], [0,1]],   //поворот 0
            "90":  [[0,0], [0,1], [0,-1], [-1,0]],  //поворот 90
            "180": [[0,0], [-1,0], [1,0], [0,-1]],  //поворот 180
            "270": [[0,0], [0,1], [0,-1], [1,0]]    //поворот 270
        }
    }
};
